app/controllers/menu/container_controller.rb

SELECT `containers`.* FROM `containers`
---
	def index
		@containers = MenuContainer.all