app/controllers/menu/groups_controller.rb

SELECT `menu_groups`.* FROM `menu_groups`
---
  def index
    @menugroups = MenuGroup.all

INSERT INTO `menu_groups` (`created_at`, `description`, `name`, `location_id`, `updated_at`) VALUES ('2011-11-03 08:35:10', 0, 'Front office', NULL, '2011-11-03 08:35:10')
---
  def create
    @status= MenuGroup.create(params[:menu_group])

SELECT `menu_groups`.* FROM `menu_groups` WHERE `menu_groups`.`id` = 4 LIMIT 1
---
  def edit
    @menu_group = MenuGroup.find(params[:id])

SELECT `menu_groups`.* FROM `menu_groups` WHERE `menu_groups`.`id` = 4 LIMIT 1
UPDATE `menu_groups` SET `updated_at` = '2011-11-15 16:54:22', `name` = 'Admin' WHERE `menu_groups`.`id` = 4
---
  def update
    @menugroup=MenuGroup.find(params[:id])
    @status = @menugroup.update_attributes(params[:menu_group])