app/controllers/menu/links_controller.rb

	def index
		@menulinks = MenuLink.all
---
SELECT `menu_links`.* FROM `menu_links`

	def create
		@menulink = MenuLink.new(params[:menu_link])
		@status=@menulink.save!
---
INSERT INTO `menu_links` (`module_context_id`, `location_id`, `status`, `updated_at`, `path`, `created_at`, `description`, `name`, `method`) VALUES (16, NULL, 'Active', '2011-11-03 08:39:22', 'new_user_registration_path', '2011-11-03 08:39:22', 'Registration for new student wil be carried out here', 'New Registration', 'GET')

	def edit
		@menu_link = MenuLink.find(params[:id])
---
SELECT `menu_links`.* FROM `menu_links` WHERE `menu_links`.`id` = 1 LIMIT 1