app/controllers/menu/modules_controller.rb

	def index
		@modulecontexts = ModuleContext.all
---
SELECT `module_contexts`.* FROM `module_contexts`

	def create
		@modulecontext= ModuleContext.new(params[:module_context])
		@status=@modulecontext.save!
---
INSERT INTO `module_contexts` (`location_id`, `link_name`, `approved_by`, `name`, `updated_at`, `status`, `created_at`) VALUES (NULL, 'new_user_registration', NULL, 'FRONT OFFICE', '2011-11-03 08:38:20', 'Active', '2011-11-03 08:38:20')

	def edit
		@module_context = ModuleContext.find(params[:id])
---
SELECT `module_contexts`.* FROM `module_contexts` WHERE `module_contexts`.`id` = 3 LIMIT 1

	def update
		@modulecontext=ModuleContext.find(params[:id])
		@status = @modulecontext.update_attributes(params[:module_context])
---
SELECT `module_contexts`.* FROM `module_contexts` WHERE `module_contexts`.`id` = 3 LIMIT 1
UPDATE `module_contexts` SET `link_name` = 'test1', `updated_at` = '2011-09-29 03:00:21', `name` = 'test1' WHERE `module_contexts`.`id` = 3

	def destroy
			@modulecontext=ModuleContext.find(params[:id])
			@status = @modulecontext.destroy
---
SELECT `module_contexts`.* FROM `module_contexts` WHERE `module_contexts`.`id` = 8 LIMIT 1
DELETE FROM `module_contexts` WHERE `module_contexts`.`id` = 8

	def load_modules
		@modules=ModuleContext.all
---
SELECT `module_contexts`.* FROM `module_contexts`