app/controllers/user/country_controller.rb

SELECT `countries`.* FROM `countries`
---
	def index
		@countries=Country.all

INSERT INTO `countries` (`updated_at`, `created_at`, `status`, `name`) VALUES ('2011-08-13 07:47:31', '2011-08-13 07:47:31', 0, 'Bharatha')
---
	def create
		@country=Country.new(params[:country])
		@country.save!

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 9 LIMIT 1
---
	def edit
		@country=Country.find(params[:id])

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 8 LIMIT 1
DELETE FROM `countries` WHERE `countries`.`id` = 8
---
	def destroy
		@country=Country.find(params[:id])
		status = @country.destroy