app/controllers/user/roles_controller.rb

INSERT INTO `roles` (`approved_on`, `updated_at`, `status`, `name`, `priority`, `created_at`, `location_id`, `created_on`, `approved_by`, `created_by`, `remarks`) VALUES (NULL, '2011-11-07 17:20:59', 0, 'Principle', NULL, '2011-11-07 17:20:59', NULL, '2011-11-07 17:20:59', NULL, 1, 'Principle Role has done with this')
---
	def create
		@role=Role.new(params[:Role])
		@status=@role.save!