app/controllers/institution/institutes_controller.rb

	def index
		@educationinstutions=EducationInstitution.all
---
SELECT `education_institutions`.* FROM `education_institutions`

	def create
	#	@educationinstutiongroup=EducationInstitutionGroup.find_by_id(params[:education_instution][:institution_group])
		@educationinstution=EducationInstitution.new(params[:education_instution])
		@educationinstution.save!
---
INSERT INTO `education_institutions` (`education_institution_group_id`, `updated_at`, `status`, `created_at`, `created_by`, `name`, `approved_by`) VALUES (6, '2011-09-21 18:43:31', 'Active', '2011-09-21 18:43:31', NULL, 'inevit1', NULL)

	def edit
		@educationinstution=EducationInstitution.find(params[:id])
---
SELECT `education_institutions`.* FROM `education_institutions` WHERE `education_institutions`.`id` = 1 LIMIT 1

	def update
		@educationinstution=EducationInstitution.find(params[:id])
		@status=@educationinstution.update_attributes(params[:education_instution])
---
SELECT `education_institutions`.* FROM `education_institutions` WHERE `education_institutions`.`id` = 1 LIMIT 1
UPDATE `education_institutions` SET `updated_at` = '2011-09-21 18:40:55', `name` = 'inevit test' WHERE `education_institutions`.`id` = 1

	def destroy
		@educationinstution=EducationInstitution.find(params[:id])
		status = @educationinstution.destroy
---
SELECT `education_institutions`.* FROM `education_institutions` WHERE `education_institutions`.`id` = 1 LIMIT 1
DELETE FROM `education_institutions` WHERE `education_institutions`.`id` = 1