app/controllers/institution/institution_groups_controller.rb

SELECT `education_institution_groups`.* FROM `education_institution_groups`
---
	def index
		@educationinstutiongroups=EducationInstitutionGroup.all

INSERT INTO `education_institution_groups` (`updated_at`, `approved_by`, `created_at`, `status`, `created_by`, `name`) VALUES ('2011-09-14 17:41:50', NULL, '2011-09-14 17:41:50', 'Active', NULL, 'inevit solutions')
---
	def create
		@educationinstutiongroup=EducationInstitutionGroup.new(params[:education_instution_group])
		respond_to do |format|
			if	@educationinstutiongroup.save

SELECT `education_institution_groups`.* FROM `education_institution_groups` WHERE `education_institution_groups`.`id` = 6 LIMIT 1
---
	def edit
		@educationinstutiongroup=EducationInstitutionGroup.find(params[:id])

SELECT `education_institution_groups`.* FROM `education_institution_groups` WHERE `education_institution_groups`.`id` = 8 LIMIT 1
UPDATE `education_institution_groups` SET `updated_at` = '2011-09-19 17:38:58', `name` = 'Inevit solutions' WHERE `education_institution_groups`.`id` = 6
---
	def update
		@educationinstutiongroup=EducationInstitutionGroup.find(params[:id])
		@status=@educationinstutiongroup.update_attributes(params[:educationinstutiongroup])

SELECT `education_institution_groups`.* FROM `education_institution_groups` WHERE `education_institution_groups`.`id` = 8 LIMIT 1
DELETE FROM `education_institution_groups` WHERE `education_institution_groups`.`id` = 8
---
	def destroy
		@educationinstutiongroup=EducationInstitutionGroup.find(params[:id])
		status = @educationinstutiongroup.destroy